app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 07 Mar 2013 14:05:50 UTC +00:00], ["description", "a"], ["image_url", ""], ["title", "c"], ["updated_at", Thu, 07 Mar 2013 14:05:50 UTC +00:00]]
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 4
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy